Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresInfo Methods
The TeklaStructuresInfo type exposes the following members.
Methods
Name | Description
GetBuildNumber
 Returns the Tekla Structures build number.
GetCommonAppDataFolder
 Returns (XSDATADIR)environments installation folder of the Tekla Structures as string.
GetCopyRightText
 Returns the Tekla Structures copyright text as string.
GetCurrentProgramVersion
 Returns the current Tekla Structures version.
GetCurrentUser
 Returns the current Tekla Structures user.
GetFullTSRegistryKeyText
Returns full registry key of the Tekla Structures as string.
GetLocalAppDataFolder
 Returns (XSUSERDATADIR) user's local appdata folder of the Tekla Structures as string.
GetPluginsFolder
 Returns main TS plugins folder, not extensions folder
GetRevisionDate
 Returns the Tekla Structures revision date as string.
Top
See Also
Reference
TeklaStructuresInfo Class
Tekla.Structures Namespace